Revit 2023 API
ReinforcementSettings.GetRebarRoundingManager Method
 Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public RebarRoundingManager GetRebarRoundingManager()
Visual Basic
Public Function GetRebarRoundingManager As RebarRoundingManager
Visual C++
public:
RebarRoundingManager^ GetRebarRoundingManager()
Return Value
 The rounding manager.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace